data/raw_bench/1200_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.568ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.565ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.566ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.564ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   564.01us  128.62us 841.00us   82.77%
    Req/Sec   314.86    180.10   800.00     61.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  551.00us
 75.000%  623.00us
 90.000%  693.00us
 99.000%  841.00us
 99.900%    1.28ms
 99.990%    4.59ms
 99.999%    6.78ms
100.000%    6.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.297     0.000000            1         1.00
       0.446     0.100000         2428         1.11
       0.476     0.200000         4809         1.25
       0.501     0.300000         7254         1.43
       0.525     0.400000         9599         1.67
       0.551     0.500000        12000         2.00
       0.564     0.550000        13172         2.22
       0.577     0.600000        14328         2.50
       0.592     0.650000        15567         2.86
       0.607     0.700000        16746         3.33
       0.623     0.750000        17898         4.00
       0.633     0.775000        18541         4.44
       0.642     0.800000        19099         5.00
       0.653     0.825000        19725         5.71
       0.664     0.850000        20287         6.67
       0.677     0.875000        20888         8.00
       0.685     0.887500        21198         8.89
       0.693     0.900000        21509        10.00
       0.702     0.912500        21804        11.43
       0.711     0.925000        22073        13.33
       0.723     0.937500        22377        16.00
       0.730     0.943750        22541        17.78
       0.737     0.950000        22674        20.00
       0.746     0.956250        22824        22.86
       0.754     0.962500        22969        26.67
       0.764     0.968750        23118        32.00
       0.771     0.971875        23203        35.56
       0.777     0.975000        23267        40.00
       0.786     0.978125        23349        45.71
       0.796     0.981250        23424        53.33
       0.808     0.984375        23490        64.00
       0.817     0.985938        23532        71.11
       0.824     0.987500        23564        80.00
       0.833     0.989062        23602        91.43
       0.848     0.990625        23641       106.67
       0.867     0.992188        23677       128.00
       0.884     0.992969        23695       142.22
       0.898     0.993750        23713       160.00
       0.922     0.994531        23734       182.86
       0.950     0.995313        23751       213.33
       0.983     0.996094        23769       256.00
       1.007     0.996484        23779       284.44
       1.042     0.996875        23788       320.00
       1.075     0.997266        23797       365.71
       1.105     0.997656        23807       426.67
       1.149     0.998047        23816       512.00
       1.205     0.998242        23821       568.89
       1.211     0.998437        23825       640.00
       1.241     0.998633        23830       731.43
       1.265     0.998828        23835       853.33
       1.283     0.999023        23839      1024.00
       1.321     0.999121        23842      1137.78
       1.370     0.999219        23844      1280.00
       1.376     0.999316        23846      1462.86
       1.450     0.999414        23849      1706.67
       1.539     0.999512        23851      2048.00
       1.565     0.999561        23852      2275.56
       1.586     0.999609        23853      2560.00
       1.894     0.999658        23854      2925.71
       2.885     0.999707        23856      3413.33
       3.699     0.999756        23857      4096.00
       3.699     0.999780        23857      4551.11
       4.363     0.999805        23858      5120.00
       4.363     0.999829        23858      5851.43
       4.547     0.999854        23859      6826.67
       4.595     0.999878        23860      8192.00
       4.595     0.999890        23860      9102.22
       4.595     0.999902        23860     10240.00
       4.595     0.999915        23860     11702.86
       6.587     0.999927        23861     13653.33
       6.587     0.999939        23861     16384.00
       6.587     0.999945        23861     18204.44
       6.587     0.999951        23861     20480.00
       6.587     0.999957        23861     23405.71
       6.775     0.999963        23862     27306.67
       6.775     1.000000        23862          inf
#[Mean    =        0.564, StdDeviation   =        0.129]
#[Max     =        6.772, Total count    =        23862]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  35778 requests in 30.01s, 6.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:   1192.31  
Transfer/sec:    231.71KB