data/raw_bench/1300_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.562ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.560ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.560ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.564ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   556.99us  116.50us 835.00us   78.49%
    Req/Sec   340.42    188.60     0.89k    66.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  544.00us
 75.000%  616.00us
 90.000%  684.00us
 99.000%  835.00us
 99.900%    1.23ms
 99.990%    2.83ms
 99.999%    5.84ms
100.000%    5.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.304     0.000000            2         1.00
       0.440     0.100000         2612         1.11
       0.471     0.200000         5252         1.25
       0.495     0.300000         7794         1.43
       0.519     0.400000        10392         1.67
       0.544     0.500000        12990         2.00
       0.556     0.550000        14196         2.22
       0.571     0.600000        15561         2.50
       0.585     0.650000        16799         2.86
       0.600     0.700000        18113         3.33
       0.616     0.750000        19380         4.00
       0.625     0.775000        20034         4.44
       0.634     0.800000        20659         5.00
       0.645     0.825000        21352         5.71
       0.656     0.850000        21938         6.67
       0.670     0.875000        22614         8.00
       0.676     0.887500        22907         8.89
       0.684     0.900000        23239        10.00
       0.693     0.912500        23554        11.43
       0.704     0.925000        23882        13.33
       0.715     0.937500        24207        16.00
       0.721     0.943750        24373        17.78
       0.728     0.950000        24520        20.00
       0.737     0.956250        24689        22.86
       0.747     0.962500        24842        26.67
       0.759     0.968750        25001        32.00
       0.767     0.971875        25088        35.56
       0.775     0.975000        25169        40.00
       0.785     0.978125        25248        45.71
       0.793     0.981250        25323        53.33
       0.804     0.984375        25405        64.00
       0.814     0.985938        25447        71.11
       0.821     0.987500        25489        80.00
       0.829     0.989062        25524        91.43
       0.843     0.990625        25565       106.67
       0.865     0.992188        25606       128.00
       0.882     0.992969        25626       142.22
       0.898     0.993750        25645       160.00
       0.925     0.994531        25666       182.86
       0.948     0.995313        25689       213.33
       0.979     0.996094        25706       256.00
       1.004     0.996484        25716       284.44
       1.025     0.996875        25726       320.00
       1.057     0.997266        25736       365.71
       1.069     0.997656        25746       426.67
       1.104     0.998047        25756       512.00
       1.126     0.998242        25761       568.89
       1.151     0.998437        25767       640.00
       1.179     0.998633        25771       731.43
       1.201     0.998828        25776       853.33
       1.248     0.999023        25781      1024.00
       1.257     0.999121        25784      1137.78
       1.300     0.999219        25786      1280.00
       1.412     0.999316        25789      1462.86
       1.510     0.999414        25791      1706.67
       1.657     0.999512        25794      2048.00
       1.744     0.999561        25795      2275.56
       1.821     0.999609        25796      2560.00
       1.930     0.999658        25798      2925.71
       1.964     0.999707        25799      3413.33
       2.149     0.999756        25800      4096.00
       2.483     0.999780        25801      4551.11
       2.483     0.999805        25801      5120.00
       2.633     0.999829        25802      5851.43
       2.831     0.999854        25803      6826.67
       2.831     0.999878        25803      8192.00
       4.207     0.999890        25804      9102.22
       4.207     0.999902        25804     10240.00
       4.207     0.999915        25804     11702.86
       4.723     0.999927        25805     13653.33
       4.723     0.999939        25805     16384.00
       4.723     0.999945        25805     18204.44
       4.723     0.999951        25805     20480.00
       4.723     0.999957        25805     23405.71
       5.835     0.999963        25806     27306.67
       5.835     1.000000        25806          inf
#[Mean    =        0.557, StdDeviation   =        0.117]
#[Max     =        5.832, Total count    =        25806]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  38758 requests in 30.01s, 7.36MB read
  Socket errors: connect 0, read 0, write 0, timeout 7
Requests/sec:   1291.71  
Transfer/sec:    251.03KB